#使用高斯贝叶斯模型预测天气
from sklearn.naive_bayes import GaussianNB

#0：晴  1：阴  2：降水  3：多云
data_table = [["data,'weather"],
              [1,0],
              [2,1],
              [3,2],
              [4,1],
              [5,2],
              [6,0],
              [7,0],
              [8,3],
              [9,1],
              [10,1]]


#当天的天气
x = [[0],[1],[2],[1],[2],[0],[0],[3],[1]]

#当天的天气对应后一天的天气
y = [1,2,1,2,0,0,3,1,1,]

#现在把训练数据和对应的分数放入分类器进行训练
clf = GaussianNB().fit(x,y)

p = [[3]]
print(clf.predict(p))
