#基因片段A，基因片段B， 高血压胆结石
#1：是 0：否
from sklearn.naive_bayes import GaussianNB
data_table = [[1,1,1,0],
              [0,0,0,1],
              [0,1,0,0],
              [1,0,0,0],
              [1,1,0,1],
              [1,0,0,1],
              [0,1,1,1],
              [0,0,0,0],
              [1,0,1,0],
              [0,1,0,1]
]   #前两列是基因片段，第三列是是否患高血压，第四列是是否患胆结石

#基因片段
x = [[1,1],[0,0],[0,1],[1,0],[1,1],[1,0],[0,1],[0,0],[1,0],[0,1]]

#高血压
y1 = [1,0,0,0,0,0,1,0,1,0]

#训练
clf = GaussianNB().fit(x,y1)

#预测是否患高血压
p = [[1,0]]
print(clf.predict(p))

#胆结石
y2 = [0,1,0,0,1,1,1,0,0,1]

#训练
clf = GaussianNB().fit(x,y2)

#预测是否患胆结石
p = [[1,0]]
print(clf.predict(p))

